In [1]:
import pandas as pd

In [2]:
import numpy as np 

# Creating empty series 
ser = pd.Series() 
print("Pandas Series: ", ser) 

# simple array 
data = np.array(['g', 'e', 'e', 'k', 's']) 
	
ser = pd.Series(data) 
print("Pandas Series:\n", ser)

Pandas Series:  Series([], dtype: object)
Pandas Series:
 0    g
1    e
2    e
3    k
4    s
dtype: object

In [3]:
# Calling DataFrame constructor 
df = pd.DataFrame() 
print(df) 

# list of strings 
lst = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks'] 
	
# Calling DataFrame constructor on list 
df = pd.DataFrame(lst) 
print(df)

Empty DataFrame
Columns: []
Index: []
        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [4]:
# intialise data of lists.
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
 
# Create DataFrame
df = pd.DataFrame(data)
 
# Print the output.
print(df)

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [5]:
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [6]:
df[['Name','Qualification']]

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [7]:
# making data frame from csv file
data = pd.read_csv("nba.csv", index_col ="Name")
 
# retrieving row by loc method
first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"]

print(first, "\n", second)

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object
 Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [10]:
first=data['Age']
first

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko    29.0
                 ...
Shelvin Mack     26.0
Raul Neto        24.0
Tibor Pleiss     26.0
Jeff Withey      26.0
NaN               NaN
Name: Age, Length: 458, dtype: float64

In [12]:
first=data.loc['John Holland']
second=data.loc['R.J. Hunter']
print(first,'\n\n',second)

Team           Boston Celtics
Number                   30.0
Position                   SG
Age                      27.0
Height                    6-5
Weight                  205.0
College     Boston University
Salary                    NaN
Name: John Holland, dtype: object

 Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [14]:
row4=data.iloc[3]
row4

Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [16]:
data.isnull().sum()

Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [17]:
data.notnull().sum()

Team        457
Number      457
Position    457
Age         457
Height      457
Weight      457
College     373
Salary      446
dtype: int64

In [18]:
data.fillna(0)

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,0,5000000.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,0,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,0,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,0,0.0,0,0.0,0,0.0,0,0.0

In [19]:
data.dropna()

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
...,...,...,...,...,...,...,...,...
Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [21]:
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
 
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
 
# iterating over rows using iterrows() function 
for i, j in df.iterrows():
    print(i, j)
    print()

0 name      aparna
degree       MBA
score         90
Name: 0, dtype: object

1 name      pankaj
degree       BCA
score         40
Name: 1, dtype: object

2 name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Geeku
degree      MBA
score        98
Name: 3, dtype: object

In [26]:
for i in df.itertuples():
    print(i)
    print(" ")

Pandas(Index=0, name='aparna', degree='MBA', score=90)

Pandas(Index=1, name='pankaj', degree='BCA', score=40)

Pandas(Index=2, name='sudhir', degree='M.Tech', score=80)

Pandas(Index=3, name='Geeku', degree='MBA', score=98)

In [30]:
columns=list(df)
for i in columns:
    print(df[i][3])
    print(" ")

Geeku

MBA

98

In [32]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [36]:
# Python program to demonstrate creating
# pandas Dataframe from lists using zip.

# List1
Name = ['tom', 'krish', 'nick', 'juli']

# List2
Age = [25, 30, 26, 22]

# get the list of tuples from two lists.
# and merge them by using zip().
list_of_tuples = list(zip(Name, Age))

# Converting lists of tuples into
# pandas Dataframe.
df = pd.DataFrame(list_of_tuples, columns = ['Name', 'Age'])

# Print data.
df

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

In [37]:
# simple array
data = [1, 2, 3, 4]
 
ser = pd.Series(data)
print(ser)

0    1
1    2
2    3
3    4
dtype: int64

In [38]:
# simple array
data = np.array(['g','e','e','k','s'])
 
ser = pd.Series(data)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [39]:
ser[:4]

0    g
1    e
2    e
3    k
dtype: object

In [40]:
ser[4]

's'

In [46]:
# making data frame from csv file
data = pd.read_csv("nba.csv")
ser = pd.Series(data['Name'])
names = ser.head(10)
names[3:6]

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
Name: Name, dtype: object

In [47]:
names.loc[3:6]

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
Name: Name, dtype: object

In [48]:
names.iloc[3:6]

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
Name: Name, dtype: object

In [49]:
# creating a series
data = pd.Series([5, 2, 3,7], index=['a', 'b', 'c', 'd'])
 
# creating a series
data1 = pd.Series([1, 6, 4, 9], index=['a', 'b', 'd', 'e'])
 
data.add(data1)

a     6.0
b     8.0
c     NaN
d    11.0
e     NaN
dtype: float64

In [51]:
data.sub(data1, fill_value=0)

a    4.0
b   -4.0
c    3.0
d    3.0
e   -9.0
dtype: float64

In [52]:
# reading csv file from url  
data = pd.read_csv("nba.csv") 
    
# dropping null value columns to avoid errors 
data.dropna(inplace = True) 
   
# storing dtype before converting 
before = data.dtypes 
   
# converting dtypes using astype 
data["Salary"]= data["Salary"].astype(int) 
data["Number"]= data["Number"].astype(str) 
   
# storing dtype after converting 
after = data.dtypes 
   
# printing to compare 
print("BEFORE CONVERSION\n", before, "\n") 
print("AFTER CONVERSION\n", after, "\n")

BEFORE CONVERSION
 Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

AFTER CONVERSION
 Name         object
Team         object
Number       object
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary        int32
dtype: object

In [53]:
# storing dtype before operation 
dtype_before = type(data["Salary"]) 
   
# converting to list 
salary_list = data["Salary"].tolist() 
   
# storing dtype after operation 
dtype_after = type(salary_list) 
   
# printing dtype 
print("Data type before converting = {}\nData type after converting = {}"
      .format(dtype_before, dtype_after)) 
   
# displaying list 
salary_list

Data type before converting = <class 'pandas.core.series.Series'>
Data type after converting = <class 'list'>

[7730337,
 6796117,
 1148640,
 1170960,
 2165160,
 1824360,
 3431040,
 2569260,
 6912869,
 3425510,
 1749840,
 2616975,
 845059,
 1500000,
 1335480,
 6300000,
 134215,
 1500000,
 19689000,
 1140240,
 947276,
 981348,
 947276,
 947276,
 11235955,
 8000000,
 1635476,
 22875000,
 845059,
 845059,
 1572360,
 12650000,
 3750000,
 1636842,
 4000000,
 167406,
 947276,
 1000000,
 4626960,
 845059,
 1074169,
 6500000,
 2144772,
 525093,
 3457800,
 4582680,
 947276,
 2869440,
 947276,
 525093,
 13600000,
 10050000,
 2500000,
 7000000,
 12000000,
 6268675,
 650000,
 3553917,
 245177,
 1509360,
 3873398,
 13800000,
 947276,
 11370786,
 2008748,
 14260870,
 11710456,
 1131960,
 845059,
 1270964,
 3815000,
 15501000,
 1100602,
 111444,
 5675000,
 525093,
 9650000,
 18907726,
 1100602,
 19689000,
 947276,
 21468695,
 3376000,
 7085000,
 3110796,
 1159680,
 3000000,
 845059,
 700000,
 845059,
 15592217,
 1724250,
 1155600,
 3132240,
 5103120,
 981348,
 947276,
 5219169,
 13500000,
 2127840,
 206192,
 1160160,
 981348,
 13500000,
 3807120,
 1035000,
 55722,
 947276,
 5500000,
 2041080,
 83397,
 981348,
 1015421,
 1449187,
 3398280,
 5013559,
 15851950,
 947276,
 525093,
 12403101,
 7700000,
 3156600,
 845059,
 9500000,
 845059,
 2250000,
 16407500,
 4500000,
 8500000,
 947276,
 2380440,
 1015421,
 13400000,
 1391160,
 20093064,
 1535880,
 1147276,
 8193029,
 16407501,
 947276,
 947276,
 1276000,
 19689000,
 111196,
 8988765,
 14260870,
 2100000,
 2500000,
 6500000,
 2170465,
 111444,
 1252440,
 2891760,
 845059,
 3272091,
 16000000,
 600000,
 13913044,
 2841960,
 6270000,
 5000000,
 3000000,
 4050000,
 1007026,
 17120106,
 8000000,
 4000000,
 1358880,
 211744,
 1100000,
 7000000,
 2357760,
 845059,
 1007026,
 3000000,
 2399040,
 947276,
 1662360,
 2943221,
 8000000,
 14700000,
 16407500,
 295327,
 845059,
 5152440,
 2109294,
 6600000,
 1733040,
 1449000,
 4290000,
 1100602,
 3950313,
 4053446,
 2085671,
 16407500,
 1270964,
 15361500,
 845059,
 947276,
 5378974,
 8193030,
 306527,
 6486486,
 8229375,
 1646400,
 200600,
 15756438,
 1000000,
 2489530,
 3189794,
 947276,
 1404600,
 5158539,
 5000000,
 3542500,
 4088019,
 9588426,
 700902,
 845059,
 1201440,
 1230840,
 9638555,
 9000000,
 5464000,
 8500000,
 1100602,
 3036927,
 2850000,
 7070730,
 169883,
 1164858,
 845059,
 10734586,
 845059,
 1320000,
 15514031,
 1015421,
 10595507,
 55722,
 3382023,
 19689000,
 1142880,
 947276,
 5250000,
 10000000,
 16407500,
 200600,
 250750,
 3578947,
 525093,
 1499187,
 2000000,
 1304520,
 2854940,
 12000000,
 1000000,
 5746479,
 18671659,
 947276,
 525093,
 3333333,
 8000000,
 947276,
 189455,
 947276,
 525093,
 6110034,
 2612520,
 6331404,
 3034356,
 5675000,
 2139000,
 12000000,
 7000000,
 4204200,
 22192730,
 10151612,
 2854940,
 261894,
 845059,
 5543725,
 525093,
 20000000,
 981348,
 2481720,
 947276,
 4171680,
 845059,
 1294440,
 2380593,
 5192520,
 2505720,
 4300000,
 11250000,
 5000000,
 4000000,
 5694674,
 4375000,
 561716,
 3300000,
 273038,
 8000000,
 1920240,
 4662960,
 2170465,
 1100602,
 200600,
 15851950,
 2814000,
 3000000,
 3533333,
 10449438,
 11235955,
 1584480,
 947276,
 4345000,
 258489,
 1474440,
 1282080,
 2148360,
 2056920,
 1938840,
 947276,
 5703600,
 5758680,
 2279040,
 3750000,
 20158622,
 3135000,
 1140240,
 16407500,
 1463040,
 222888,
 3344000,
 2021520,
 1210800,
 4500000,
 5138430,
 16744218,
 525093,
 8042895,
 625093,
 947276,
 6980802,
 2894059,
 6000000,
 5016000,
 3075880,
 4236287,
 2525160,
 525093,
 1415520,
 2854940,
 2637720,
 4775000,
 2658240,
 9463484,
 12000000,
 15409570,
 1348440,
 981348,
 2239800,
 2433333,
 947276]

In [54]:
ser=pd.Series()
print(ser)

Series([], dtype: object)

In [55]:
# a simple dictionary
dict = {'Geeks': 10,
        'for': 20,
        'geeks': 30}
 
# create series from dictionary
ser = pd.Series(dict)
 
print(ser)

Geeks    10
for      20
geeks    30
dtype: int64

In [56]:
# giving a scalar value with index
ser = pd.Series(10, index=[0, 1, 2, 3, 4, 5])
 
print(ser)

0    10
1    10
2    10
3    10
4    10
5    10
dtype: int64

In [58]:
ser=pd.Series(np.arange(10))
ser

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [59]:
# series with numpy linspace()
ser1 = pd.Series(np.linspace(3, 33, 3))
print(ser1)

0     3.0
1    18.0
2    33.0
dtype: float64

In [60]:
ser=pd.Series([x for x in range(10)])
ser

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [66]:
ser=np.arange(10,15)
ser

array([10, 11, 12, 13, 14])

In [67]:
ser_mul=pd.Series(data=ser*5,index=ser)
ser_mul

10    50
11    55
12    60
13    65
14    70
dtype: int32